clique.org
#+TITLE:    CLIQUE Benchmark Instances
#+OPTIONS: ^:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../Pub/solarized-light.css" />

-----
* Utils
- [[./instances/converter.tar.gz][Converter]]: convert from benchmarks from ~ascii~ to ~binary~ format and vice versa.

