clique.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CLIQUE Benchmark Instances</title>
<!-- 2017-01-01 Sun 23:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="tnguyen@GiaoChi" />
<link rel="stylesheet" type="text/css" href="../Pub/solarized-light.css" />
</head>
<body>
<div id="content">
<h1 class="title">CLIQUE Benchmark Instances</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Utils</a></li>
<li><a href="#sec-2">2. DIMACS Instances</a></li>
<li><a href="#sec-3">3. Additional Instances</a></li>
<li><a href="#sec-4">4. Categories</a></li>
<li><a href="#sec-5">5. Other Instances</a></li>
</ul>
</div>
</div>
<hr  />
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Utils</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./instances/converter.tar.gz">Converter</a>: convert from benchmarks from <code>ascii</code> to <code>binary</code> format and vice versa.
</li>
</ul>
</div>
</div>
