clique.org
* DIMACS Instances
  [[./instances/clique/DIMACS_cliques/][Directory]], 
  [[./instances/clique/DIMACS_cliques.tar.gz][tar.gz format]]

Files from Dimacs [[ftp://dimacs.rutgers.edu/pub/challenge/graph/benchmarks/clique/][ftp://dimacs.rutgers.edu/pub/challenge/graph/benchmarks/clique/]] in binary format (~*.clq.b~).

#+NAME: tab:dimacs
|    | File                                                                         | Max Clique[fn:1] |
|----+------------------------------------------------------------------------------+------------------|
|  1 | [[./instances/clique/DIMACS_cliques/brock200_1.clq.b     ][brock200_1     ]] |               21 |
|  2 | [[./instances/clique/DIMACS_cliques/brock200_2.clq.b     ][brock200_2     ]] |               12 |
|  3 | [[./instances/clique/DIMACS_cliques/brock200_3.clq.b     ][brock200_3     ]] |               15 |
|  4 | [[./instances/clique/DIMACS_cliques/brock200_4.clq.b     ][brock200_4     ]] |               17 |
|  5 | [[./instances/clique/DIMACS_cliques/brock400_1.clq.b     ][brock400_1     ]] |               27 |
|  6 | [[./instances/clique/DIMACS_cliques/brock400_2.clq.b     ][brock400_2     ]] |               29 |
|  7 | [[./instances/clique/DIMACS_cliques/brock400_3.clq.b     ][brock400_3     ]] |               31 |
|  8 | [[./instances/clique/DIMACS_cliques/brock400_4.clq.b     ][brock400_4     ]] |               33 |
|  9 | [[./instances/clique/DIMACS_cliques/brock800_1.clq.b     ][brock800_1     ]] |               23 |
| 10 | [[./instances/clique/DIMACS_cliques/brock800_2.clq.b     ][brock800_2     ]] |               24 |
| 11 | [[./instances/clique/DIMACS_cliques/brock800_3.clq.b     ][brock800_3     ]] |               25 |
| 12 | [[./instances/clique/DIMACS_cliques/brock800_4.clq.b     ][brock800_4     ]] |               26 |
| 13 | [[./instances/clique/DIMACS_cliques/c-fat200-1.clq.b     ][c-fat200-1     ]] |               12 |
| 14 | [[./instances/clique/DIMACS_cliques/c-fat200-2.clq.b     ][c-fat200-2     ]] |               24 |
| 15 | [[./instances/clique/DIMACS_cliques/c-fat200-5.clq.b     ][c-fat200-5     ]] |               58 |
| 16 | [[./instances/clique/DIMACS_cliques/c-fat500-1.clq.b     ][c-fat500-1     ]] |               14 |
| 17 | [[./instances/clique/DIMACS_cliques/c-fat500-2.clq.b     ][c-fat500-2     ]] |               26 |
| 18 | [[./instances/clique/DIMACS_cliques/c-fat500-5.clq.b     ][c-fat500-5     ]] |               64 |
| 19 | [[./instances/clique/DIMACS_cliques/c-fat500-10.clq.b    ][c-fat500-10    ]] |              126 |
| 20 | [[./instances/clique/DIMACS_cliques/hamming6-2.clq.b     ][hamming6-2     ]] |               32 |
| 21 | [[./instances/clique/DIMACS_cliques/hamming6-4.clq.b     ][hamming6-4     ]] |                4 |
| 22 | [[./instances/clique/DIMACS_cliques/hamming8-2.clq.b     ][hamming8-2     ]] |              128 |
| 23 | [[./instances/clique/DIMACS_cliques/hamming8-4.clq.b     ][hamming8-4     ]] |               16 |
| 24 | [[./instances/clique/DIMACS_cliques/hamming10-2.clq.b    ][hamming10-2    ]] |              512 |
| 25 | [[./instances/clique/DIMACS_cliques/hamming10-4.clq.b    ][hamming10-4    ]] |               40 |
| 26 | [[./instances/clique/DIMACS_cliques/johnson8-2-4.clq.b   ][johnson8-2-4   ]] |                4 |
| 27 | [[./instances/clique/DIMACS_cliques/johnson8-4-4.clq.b   ][johnson8-4-4   ]] |               14 |
| 28 | [[./instances/clique/DIMACS_cliques/johnson16-2-4.clq.b  ][johnson16-2-4  ]] |                8 |
| 29 | [[./instances/clique/DIMACS_cliques/johnson32-2-4.clq.b  ][johnson32-2-4  ]] |               16 |
| 30 | [[./instances/clique/DIMACS_cliques/keller4.clq.b        ][keller4        ]] |               11 |
| 31 | [[./instances/clique/DIMACS_cliques/keller5.clq.b        ][keller5        ]] |               27 |
| 32 | [[./instances/clique/DIMACS_cliques/keller6.clq.b        ][keller6        ]] |         $\ge$ 59 |
| 33 | [[./instances/clique/DIMACS_cliques/MANN_a9.clq.b        ][MANN_a9        ]] |               16 |
| 34 | [[./instances/clique/DIMACS_cliques/MANN_a27.clq.b       ][MANN_a27       ]] |              126 |
| 35 | [[./instances/clique/DIMACS_cliques/MANN_a44.clq.b       ][MANN_a45       ]] |              345 |
| 36 | [[./instances/clique/DIMACS_cliques/MANN_a81.clq.b       ][MANN_a81       ]] |       $\ge$ 1100 |
| 37 | [[./instances/clique/DIMACS_cliques/p_hat300-1.clq.b     ][p_hat300-1     ]] |                8 |
| 38 | [[./instances/clique/DIMACS_cliques/p_hat300-2.clq.b     ][p_hat300-2     ]] |               25 |
| 39 | [[./instances/clique/DIMACS_cliques/p_hat300-3.clq.b     ][p_hat300-3     ]] |               36 |
| 40 | [[./instances/clique/DIMACS_cliques/p_hat500-1.clq.b     ][p_hat500-1     ]] |                9 |
| 41 | [[./instances/clique/DIMACS_cliques/p_hat500-2.clq.b     ][p_hat500-2     ]] |               36 |
| 42 | [[./instances/clique/DIMACS_cliques/p_hat500-3.clq.b     ][p_hat500-3     ]] |         $\ge$ 50 |
| 43 | [[./instances/clique/DIMACS_cliques/p_hat700-1.clq.b     ][p_hat700-1     ]] |               11 |
| 44 | [[./instances/clique/DIMACS_cliques/p_hat700-2.clq.b     ][p_hat700-2     ]] |         $\ge$ 44 |
| 45 | [[./instances/clique/DIMACS_cliques/p_hat700-3.clq.b     ][p_hat700-3     ]] |         $\ge$ 62 |
| 46 | [[./instances/clique/DIMACS_cliques/p_hat1000-1.clq.b    ][p_hat1000-1    ]] |         $\ge$ 10 |
| 47 | [[./instances/clique/DIMACS_cliques/p_hat1000-2.clq.b    ][p_hat1000-2    ]] |         $\ge$ 46 |
| 48 | [[./instances/clique/DIMACS_cliques/p_hat1000-3.clq.b    ][p_hat1000-3    ]] |         $\ge$ 68 |
| 49 | [[./instances/clique/DIMACS_cliques/p_hat1500-1.clq.b    ][p_hat1500-1    ]] |         $\ge$ 12 |
| 50 | [[./instances/clique/DIMACS_cliques/p_hat1500-2.clq.b    ][p_hat1500-2    ]] |         $\ge$ 65 |
| 51 | [[./instances/clique/DIMACS_cliques/p_hat1500-3.clq.b    ][p_hat1500-3    ]] |         $\ge$ 94 |
| 52 | [[./instances/clique/DIMACS_cliques/san200_0.7_1.clq.b   ][san200_0.7_1   ]] |               30 |
| 53 | [[./instances/clique/DIMACS_cliques/san200_0.7_2.clq.b   ][san200_0.7_2   ]] |               18 |
| 54 | [[./instances/clique/DIMACS_cliques/san200_0.9_1.clq.b   ][san200_0.9_1   ]] |               70 |
| 55 | [[./instances/clique/DIMACS_cliques/san200_0.9_2.clq.b   ][san200_0.9_2   ]] |               60 |
| 56 | [[./instances/clique/DIMACS_cliques/san200_0.9_3.clq.b   ][san200_0.9_3   ]] |               44 |
| 57 | [[./instances/clique/DIMACS_cliques/san400_0.5_1.clq.b   ][san400_0.5_1   ]] |               13 |
| 58 | [[./instances/clique/DIMACS_cliques/san400_0.7_1.clq.b   ][san400_0.7_1   ]] |               40 |
| 59 | [[./instances/clique/DIMACS_cliques/san400_0.7_2.clq.b   ][san400_0.7_2   ]] |               30 |
| 60 | [[./instances/clique/DIMACS_cliques/san400_0.7_3.clq.b   ][san400_0.7_3   ]] |               22 |
| 61 | [[./instances/clique/DIMACS_cliques/san400_0.9_1.clq.b   ][san400_0.9_1   ]] |              100 |
| 62 | [[./instances/clique/DIMACS_cliques/san1000.clq.b        ][san1000        ]] |               15 |
| 63 | [[./instances/clique/DIMACS_cliques/sanr200_0.7.clq.b    ][sanr200_0.7    ]] |               18 |
| 64 | [[./instances/clique/DIMACS_cliques/sanr200_0.9.clq.b    ][sanr200_0.9    ]] |               42 |
| 65 | [[./instances/clique/DIMACS_cliques/sanr400_0.5.clq.b    ][sanr400_0.5    ]] |               13 |
| 66 | [[./instances/clique/DIMACS_cliques/sanr400_0.7.clq.b    ][sanr400_0.7    ]] |               21 |
|----+------------------------------------------------------------------------------+------------------|
#+tblfm: $1=@#-1   

