clique.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> DIMACS Instances</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="./instances/clique/DIMACS_cliques/">Directory</a>, 
<a href="./instances/clique/DIMACS_cliques.tar.gz">tar.gz format</a>
</p>

<p>
Files from Dimacs <a href="ftp://dimacs.rutgers.edu/pub/challenge/graph/benchmarks/clique/"><a href="ftp://dimacs.rutgers.edu/pub/challenge/graph/benchmarks/clique/">ftp://dimacs.rutgers.edu/pub/challenge/graph/benchmarks/clique/</a></a> in binary format (<code>*.clq.b</code>).
</p>

<table id="tab:dimacs" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Max Clique<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock200_1.clq.b     ">brock200_1     </a></td>
<td class="right">21</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock200_2.clq.b     ">brock200_2     </a></td>
<td class="right">12</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock200_3.clq.b     ">brock200_3     </a></td>
<td class="right">15</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock200_4.clq.b     ">brock200_4     </a></td>
<td class="right">17</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock400_1.clq.b     ">brock400_1     </a></td>
<td class="right">27</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock400_2.clq.b     ">brock400_2     </a></td>
<td class="right">29</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock400_3.clq.b     ">brock400_3     </a></td>
<td class="right">31</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock400_4.clq.b     ">brock400_4     </a></td>
<td class="right">33</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock800_1.clq.b     ">brock800_1     </a></td>
<td class="right">23</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock800_2.clq.b     ">brock800_2     </a></td>
<td class="right">24</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock800_3.clq.b     ">brock800_3     </a></td>
<td class="right">25</td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/brock800_4.clq.b     ">brock800_4     </a></td>
<td class="right">26</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat200-1.clq.b     ">c-fat200-1     </a></td>
<td class="right">12</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat200-2.clq.b     ">c-fat200-2     </a></td>
<td class="right">24</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat200-5.clq.b     ">c-fat200-5     </a></td>
<td class="right">58</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat500-1.clq.b     ">c-fat500-1     </a></td>
<td class="right">14</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat500-2.clq.b     ">c-fat500-2     </a></td>
<td class="right">26</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat500-5.clq.b     ">c-fat500-5     </a></td>
<td class="right">64</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/c-fat500-10.clq.b    ">c-fat500-10    </a></td>
<td class="right">126</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/hamming6-2.clq.b     ">hamming6-2     </a></td>
<td class="right">32</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/hamming6-4.clq.b     ">hamming6-4     </a></td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/hamming8-2.clq.b     ">hamming8-2     </a></td>
<td class="right">128</td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/hamming8-4.clq.b     ">hamming8-4     </a></td>
<td class="right">16</td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/hamming10-2.clq.b    ">hamming10-2    </a></td>
<td class="right">512</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/hamming10-4.clq.b    ">hamming10-4    </a></td>
<td class="right">40</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/johnson8-2-4.clq.b   ">johnson8-2-4   </a></td>
<td class="right">4</td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/johnson8-4-4.clq.b   ">johnson8-4-4   </a></td>
<td class="right">14</td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/johnson16-2-4.clq.b  ">johnson16-2-4  </a></td>
<td class="right">8</td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/johnson32-2-4.clq.b  ">johnson32-2-4  </a></td>
<td class="right">16</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/keller4.clq.b        ">keller4        </a></td>
<td class="right">11</td>
</tr>

<tr>
<td class="right">31</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/keller5.clq.b        ">keller5        </a></td>
<td class="right">27</td>
</tr>

<tr>
<td class="right">32</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/keller6.clq.b        ">keller6        </a></td>
<td class="right">\(\ge\) 59</td>
</tr>

<tr>
<td class="right">33</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/MANN_a9.clq.b        ">MANN_a9        </a></td>
<td class="right">16</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/MANN_a27.clq.b       ">MANN_a27       </a></td>
<td class="right">126</td>
</tr>

<tr>
<td class="right">35</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/MANN_a44.clq.b       ">MANN_a45       </a></td>
<td class="right">345</td>
</tr>

<tr>
<td class="right">36</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/MANN_a81.clq.b       ">MANN_a81       </a></td>
<td class="right">\(\ge\) 1100</td>
</tr>

<tr>
<td class="right">37</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat300-1.clq.b     ">p_hat300-1     </a></td>
<td class="right">8</td>
</tr>

<tr>
<td class="right">38</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat300-2.clq.b     ">p_hat300-2     </a></td>
<td class="right">25</td>
</tr>

<tr>
<td class="right">39</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat300-3.clq.b     ">p_hat300-3     </a></td>
<td class="right">36</td>
</tr>

<tr>
<td class="right">40</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat500-1.clq.b     ">p_hat500-1     </a></td>
<td class="right">9</td>
</tr>

<tr>
<td class="right">41</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat500-2.clq.b     ">p_hat500-2     </a></td>
<td class="right">36</td>
</tr>

<tr>
<td class="right">42</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat500-3.clq.b     ">p_hat500-3     </a></td>
<td class="right">\(\ge\) 50</td>
</tr>

<tr>
<td class="right">43</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat700-1.clq.b     ">p_hat700-1     </a></td>
<td class="right">11</td>
</tr>

<tr>
<td class="right">44</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat700-2.clq.b     ">p_hat700-2     </a></td>
<td class="right">\(\ge\) 44</td>
</tr>

<tr>
<td class="right">45</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat700-3.clq.b     ">p_hat700-3     </a></td>
<td class="right">\(\ge\) 62</td>
</tr>

<tr>
<td class="right">46</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat1000-1.clq.b    ">p_hat1000-1    </a></td>
<td class="right">\(\ge\) 10</td>
</tr>

<tr>
<td class="right">47</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat1000-2.clq.b    ">p_hat1000-2    </a></td>
<td class="right">\(\ge\) 46</td>
</tr>

<tr>
<td class="right">48</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat1000-3.clq.b    ">p_hat1000-3    </a></td>
<td class="right">\(\ge\) 68</td>
</tr>

<tr>
<td class="right">49</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat1500-1.clq.b    ">p_hat1500-1    </a></td>
<td class="right">\(\ge\) 12</td>
</tr>

<tr>
<td class="right">50</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat1500-2.clq.b    ">p_hat1500-2    </a></td>
<td class="right">\(\ge\) 65</td>
</tr>

<tr>
<td class="right">51</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/p_hat1500-3.clq.b    ">p_hat1500-3    </a></td>
<td class="right">\(\ge\) 94</td>
</tr>

<tr>
<td class="right">52</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san200_0.7_1.clq.b   ">san200_0.7_1   </a></td>
<td class="right">30</td>
</tr>

<tr>
<td class="right">53</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san200_0.7_2.clq.b   ">san200_0.7_2   </a></td>
<td class="right">18</td>
</tr>

<tr>
<td class="right">54</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san200_0.9_1.clq.b   ">san200_0.9_1   </a></td>
<td class="right">70</td>
</tr>

<tr>
<td class="right">55</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san200_0.9_2.clq.b   ">san200_0.9_2   </a></td>
<td class="right">60</td>
</tr>

<tr>
<td class="right">56</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san200_0.9_3.clq.b   ">san200_0.9_3   </a></td>
<td class="right">44</td>
</tr>

<tr>
<td class="right">57</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san400_0.5_1.clq.b   ">san400_0.5_1   </a></td>
<td class="right">13</td>
</tr>

<tr>
<td class="right">58</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san400_0.7_1.clq.b   ">san400_0.7_1   </a></td>
<td class="right">40</td>
</tr>

<tr>
<td class="right">59</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san400_0.7_2.clq.b   ">san400_0.7_2   </a></td>
<td class="right">30</td>
</tr>

<tr>
<td class="right">60</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san400_0.7_3.clq.b   ">san400_0.7_3   </a></td>
<td class="right">22</td>
</tr>

<tr>
<td class="right">61</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san400_0.9_1.clq.b   ">san400_0.9_1   </a></td>
<td class="right">100</td>
</tr>

<tr>
<td class="right">62</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/san1000.clq.b        ">san1000        </a></td>
<td class="right">15</td>
</tr>

<tr>
<td class="right">63</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/sanr200_0.7.clq.b    ">sanr200_0.7    </a></td>
<td class="right">18</td>
</tr>

<tr>
<td class="right">64</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/sanr200_0.9.clq.b    ">sanr200_0.9    </a></td>
<td class="right">42</td>
</tr>

<tr>
<td class="right">65</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/sanr400_0.5.clq.b    ">sanr400_0.5    </a></td>
<td class="right">13</td>
</tr>

<tr>
<td class="right">66</td>
<td class="left"><a href="./instances/clique/DIMACS_cliques/sanr400_0.7.clq.b    ">sanr400_0.7    </a></td>
<td class="right">21</td>
</tr>
</tbody>
</table>
</div>
</div>
