clique.org
* Additional Instances
  [[./instances/clique/Additional_cliques/][Directory]], 
  [[./instances/clique/Additional_cliques.tar.gz][tar.gz format]] 

Files from Mike Trick [[http://mat.gsia.cmu.edu/COLOR02/clq.html][http://mat.gsia.cmu.edu/COLOR02/clq.html]]. For the ~brock~ graphs below, there is an "off-by-one" error in the comments: if it claims node 26, for example, is in the clique, it is really node 27.


|    | File                                                                         | Max Clique[fn:1] |
|----+------------------------------------------------------------------------------+------------------|
|  1 | [[./instances/clique/Additional_cliques/brock200_2.clq    ][brock200_2     ]] |               12 |
|  2 | [[./instances/clique/Additional_cliques/brock200_4.clq    ][brock200_4     ]] |               17 |
|  3 | [[./instances/clique/Additional_cliques/brock400_2.clq    ][brock400_2     ]] |               29 |
|  4 | [[./instances/clique/Additional_cliques/brock400_4.clq    ][brock400_4     ]] |               33 |
|  5 | [[./instances/clique/Additional_cliques/brock800_2.clq    ][brock800_2     ]] |               24 |
|  6 | [[./instances/clique/Additional_cliques/brock800_4.clq    ][brock800_4     ]] |               26 |
|  7 | [[./instances/clique/Additional_cliques/C125.9.clq        ][C125.9         ]] |         $\ge$ 34 |
|  8 | [[./instances/clique/Additional_cliques/C250.9.clq        ][C250.9         ]] |         $\ge$ 44 |
|  9 | [[./instances/clique/Additional_cliques/C500.9.clq        ][C500.9         ]] |         $\ge$ 57 |
| 10 | [[./instances/clique/Additional_cliques/C1000.9.clq       ][C1000.9        ]] |         $\ge$ 68 |
| 11 | [[./instances/clique/Additional_cliques/C2000.5.clq       ][C2000.5        ]] |         $\ge$ 16 |
| 12 | [[./instances/clique/Additional_cliques/C2000.9.clq       ][C2000.9        ]] |         $\ge$ 77 |
| 13 | [[./instances/clique/Additional_cliques/C4000.5.clq       ][C4000.5        ]] |         $\ge$ 18 |
| 14 | [[./instances/clique/Additional_cliques/DSJC500.5.clq     ][DSJC500.5      ]] |         $\ge$ 13 |
| 15 | [[./instances/clique/Additional_cliques/DSJC1000.5.clq    ][DSJC1000.5     ]] |         $\ge$ 15 |
| 16 | [[./instances/clique/Additional_cliques/gen200_p0.9_44.clq][gen200_p0.9_44 ]] |               44 |
| 17 | [[./instances/clique/Additional_cliques/gen200_p0.9_55.clq][gen200_p0.9_55 ]] |               55 |
| 18 | [[./instances/clique/Additional_cliques/gen400_p0.9_55.clq][gen400_p0.9_55 ]] |               55 |
| 19 | [[./instances/clique/Additional_cliques/gen400_p0.9_65.clq][gen400_p0.9_65 ]] |               65 |
| 20 | [[./instances/clique/Additional_cliques/gen400_p0.9_75.clq][gen400_p0.9_75 ]] |               75 |
| 21 | [[./instances/clique/Additional_cliques/hamming8-4.clq    ][hamming8-4     ]] |               16 |
| 22 | [[./instances/clique/Additional_cliques/hamming10-4.clq   ][hamming10-4    ]] |               40 |
| 23 | [[./instances/clique/Additional_cliques/keller4.clq       ][keller4        ]] |               11 |
| 24 | [[./instances/clique/Additional_cliques/keller5.clq       ][keller5        ]] |               27 |
| 25 | [[./instances/clique/Additional_cliques/keller6.clq       ][keller6        ]] |         $\ge$ 59 |
| 26 | [[./instances/clique/Additional_cliques/MANN_a27.clq      ][MANN_a27       ]] |              126 |
| 27 | [[./instances/clique/Additional_cliques/MANN_a44.clq      ][MANN_a45       ]] |              345 |
| 28 | [[./instances/clique/Additional_cliques/MANN_a81.clq      ][MANN_a81       ]] |       $\ge$ 1100 |
| 29 | [[./instances/clique/Additional_cliques/p_hat300-1.clq    ][p_hat300-1     ]] |                8 |
| 30 | [[./instances/clique/Additional_cliques/p_hat300-2.clq    ][p_hat300-2     ]] |               25 |
| 31 | [[./instances/clique/Additional_cliques/p_hat300-3.clq    ][p_hat300-3     ]] |               36 |
| 32 | [[./instances/clique/Additional_cliques/p_hat700-1.clq    ][p_hat700-1     ]] |               11 |
| 33 | [[./instances/clique/Additional_cliques/p_hat700-2.clq    ][p_hat700-2     ]] |         $\ge$ 44 |
| 34 | [[./instances/clique/Additional_cliques/p_hat700-3.clq    ][p_hat700-3     ]] |         $\ge$ 62 |
| 35 | [[./instances/clique/Additional_cliques/p_hat1500-1.clq   ][p_hat1500-1    ]] |         $\ge$ 12 |
| 36 | [[./instances/clique/Additional_cliques/p_hat1500-2.clq   ][p_hat1500-2    ]] |         $\ge$ 65 |
| 37 | [[./instances/clique/Additional_cliques/p_hat1500-3.clq   ][p_hat1500-3    ]] |         $\ge$ 94 |
|----+------------------------------------------------------------------------------+------------------|
#+tblfm: $1=@#-1   

