clique.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Additional Instances</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="./instances/clique/Additional_cliques/">Directory</a>, 
<a href="./instances/clique/Additional_cliques.tar.gz">tar.gz format</a> 
</p>

<p>
Files from Mike Trick <a href="http://mat.gsia.cmu.edu/COLOR02/clq.html"><a href="http://mat.gsia.cmu.edu/COLOR02/clq.html">http://mat.gsia.cmu.edu/COLOR02/clq.html</a></a>. For the <code>brock</code> graphs below, there is an "off-by-one" error in the comments: if it claims node 26, for example, is in the clique, it is really node 27.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">File</th>
<th scope="col" class="right">Max Clique<sup><a id="fnr.1.100" name="fnr.1.100" class="footref" href="#fn.1">1</a></sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left"><a href="./instances/clique/Additional_cliques/brock200_2.clq    ">brock200_2     </a></td>
<td class="right">12</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left"><a href="./instances/clique/Additional_cliques/brock200_4.clq    ">brock200_4     </a></td>
<td class="right">17</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left"><a href="./instances/clique/Additional_cliques/brock400_2.clq    ">brock400_2     </a></td>
<td class="right">29</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left"><a href="./instances/clique/Additional_cliques/brock400_4.clq    ">brock400_4     </a></td>
<td class="right">33</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left"><a href="./instances/clique/Additional_cliques/brock800_2.clq    ">brock800_2     </a></td>
<td class="right">24</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left"><a href="./instances/clique/Additional_cliques/brock800_4.clq    ">brock800_4     </a></td>
<td class="right">26</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C125.9.clq        ">C125.9         </a></td>
<td class="right">\(\ge\) 34</td>
</tr>

<tr>
<td class="right">8</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C250.9.clq        ">C250.9         </a></td>
<td class="right">\(\ge\) 44</td>
</tr>

<tr>
<td class="right">9</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C500.9.clq        ">C500.9         </a></td>
<td class="right">\(\ge\) 57</td>
</tr>

<tr>
<td class="right">10</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C1000.9.clq       ">C1000.9        </a></td>
<td class="right">\(\ge\) 68</td>
</tr>

<tr>
<td class="right">11</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C2000.5.clq       ">C2000.5        </a></td>
<td class="right">\(\ge\) 16</td>
</tr>

<tr>
<td class="right">12</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C2000.9.clq       ">C2000.9        </a></td>
<td class="right">\(\ge\) 77</td>
</tr>

<tr>
<td class="right">13</td>
<td class="left"><a href="./instances/clique/Additional_cliques/C4000.5.clq       ">C4000.5        </a></td>
<td class="right">\(\ge\) 18</td>
</tr>

<tr>
<td class="right">14</td>
<td class="left"><a href="./instances/clique/Additional_cliques/DSJC500.5.clq     ">DSJC500.5      </a></td>
<td class="right">\(\ge\) 13</td>
</tr>

<tr>
<td class="right">15</td>
<td class="left"><a href="./instances/clique/Additional_cliques/DSJC1000.5.clq    ">DSJC1000.5     </a></td>
<td class="right">\(\ge\) 15</td>
</tr>

<tr>
<td class="right">16</td>
<td class="left"><a href="./instances/clique/Additional_cliques/gen200_p0.9_44.clq">gen200_p0.9_44 </a></td>
<td class="right">44</td>
</tr>

<tr>
<td class="right">17</td>
<td class="left"><a href="./instances/clique/Additional_cliques/gen200_p0.9_55.clq">gen200_p0.9_55 </a></td>
<td class="right">55</td>
</tr>

<tr>
<td class="right">18</td>
<td class="left"><a href="./instances/clique/Additional_cliques/gen400_p0.9_55.clq">gen400_p0.9_55 </a></td>
<td class="right">55</td>
</tr>

<tr>
<td class="right">19</td>
<td class="left"><a href="./instances/clique/Additional_cliques/gen400_p0.9_65.clq">gen400_p0.9_65 </a></td>
<td class="right">65</td>
</tr>

<tr>
<td class="right">20</td>
<td class="left"><a href="./instances/clique/Additional_cliques/gen400_p0.9_75.clq">gen400_p0.9_75 </a></td>
<td class="right">75</td>
</tr>

<tr>
<td class="right">21</td>
<td class="left"><a href="./instances/clique/Additional_cliques/hamming8-4.clq    ">hamming8-4     </a></td>
<td class="right">16</td>
</tr>

<tr>
<td class="right">22</td>
<td class="left"><a href="./instances/clique/Additional_cliques/hamming10-4.clq   ">hamming10-4    </a></td>
<td class="right">40</td>
</tr>

<tr>
<td class="right">23</td>
<td class="left"><a href="./instances/clique/Additional_cliques/keller4.clq       ">keller4        </a></td>
<td class="right">11</td>
</tr>

<tr>
<td class="right">24</td>
<td class="left"><a href="./instances/clique/Additional_cliques/keller5.clq       ">keller5        </a></td>
<td class="right">27</td>
</tr>

<tr>
<td class="right">25</td>
<td class="left"><a href="./instances/clique/Additional_cliques/keller6.clq       ">keller6        </a></td>
<td class="right">\(\ge\) 59</td>
</tr>

<tr>
<td class="right">26</td>
<td class="left"><a href="./instances/clique/Additional_cliques/MANN_a27.clq      ">MANN_a27       </a></td>
<td class="right">126</td>
</tr>

<tr>
<td class="right">27</td>
<td class="left"><a href="./instances/clique/Additional_cliques/MANN_a44.clq      ">MANN_a45       </a></td>
<td class="right">345</td>
</tr>

<tr>
<td class="right">28</td>
<td class="left"><a href="./instances/clique/Additional_cliques/MANN_a81.clq      ">MANN_a81       </a></td>
<td class="right">\(\ge\) 1100</td>
</tr>

<tr>
<td class="right">29</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat300-1.clq    ">p_hat300-1     </a></td>
<td class="right">8</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat300-2.clq    ">p_hat300-2     </a></td>
<td class="right">25</td>
</tr>

<tr>
<td class="right">31</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat300-3.clq    ">p_hat300-3     </a></td>
<td class="right">36</td>
</tr>

<tr>
<td class="right">32</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat700-1.clq    ">p_hat700-1     </a></td>
<td class="right">11</td>
</tr>

<tr>
<td class="right">33</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat700-2.clq    ">p_hat700-2     </a></td>
<td class="right">\(\ge\) 44</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat700-3.clq    ">p_hat700-3     </a></td>
<td class="right">\(\ge\) 62</td>
</tr>

<tr>
<td class="right">35</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat1500-1.clq   ">p_hat1500-1    </a></td>
<td class="right">\(\ge\) 12</td>
</tr>

<tr>
<td class="right">36</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat1500-2.clq   ">p_hat1500-2    </a></td>
<td class="right">\(\ge\) 65</td>
</tr>

<tr>
<td class="right">37</td>
<td class="left"><a href="./instances/clique/Additional_cliques/p_hat1500-3.clq   ">p_hat1500-3    </a></td>
<td class="right">\(\ge\) 94</td>
</tr>
</tbody>
</table>
</div>
</div>
