clique.org
* Categories
Reference: [[http://mat.gsia.cmu.edu/contents.clique.ps][http://mat.gsia.cmu.edu/contents.clique.ps]], 
[[./instances/others/cached/contents.clique.ps][(cached)]]

- CFat :: (From Panos Pardalos pardalos@math.uflorida.edu) 
  Problems based on fault diagnosis problems. Original reference is 
  Berman and Pelc, "Distributed Fault Diagnosis for Multiprocessor Systems," 
  Proceedings of the 20th Annual Symposium on Fault-Tolerant Computing, 
  340-346 (1990). 
  For more instances, see the generator in graph/contributed/pardalos. 

- Joh :: (From Panos Pardalos pardalos@math.uflorida.edu) 
  Problems based  on problem in coding theory. 
  A Johnson graph with parameters n; w; d has a node for every binary vector 
  of length n with exactly w 1s. Two vertices are adjacent if and only if 
  their hamming distance is at least d. A clique then represents a feasible 
  set of vectors for a code. 
  For more instances, see the generator in graph/contributed/pardalos.

- Kel :: (From Peter Shor shor@research.att.com) 
  Problems based on Keller's conjecture on tilings using hypercubes. 
  One reference is J.C. Lagarias and P.W. Shor, 
  "Keller's Cube-Tiling Conjecture is False in High Dimensions," 
  Bulletin of the AMS, 27: 279-283 (1992). 
  For more instances (though they get very large very fast) see either 
  the generator in graph/contributed/shor or the generator 
  in graph/contributed/pardalos.

- Ham :: (From Panos Pardalos pardalos@math.uflorida.edu) 
  Another coding theory problem. A Hamming graph with parameters n and d 
  has a node for each binary vector of length n. Two nodes are adjacent 
  if and only if the corresponding bit vectors are hamming distance at 
  least d apart. 
  For more instances, see the generator in graph/contributed/pardalos. 
  It has been noted by participants that n- -2 graphs have a maximum 
  clique of size $2^{n-1}$. 
  For a proof of this, see the note in graph/contributed/bourjolly/hamming.tex.

- San :: (From Laura Sanchis laura@cs.colgate.edu) 
  Instances based on her "Test Case Construction for Vertex Cover Problem," 
  DIMACS Workshop on Computational Support for Discrete Mathematics, 
  March 1992 along with more recent work that will be part of a technical 
  report to be published. The generator generates instances with known clique size.

- SanR :: (From Laura Sanchis laura@cs.colgate.edu) 
  These are random instances with sizes similar to those in San.

- Bro :: (From Mark Brockington brock@cs.ualberta.ca) 
  Instances from Mark Brockington and Joe Culberson's generator that 
  attempts to "hide" cliques in a graph where the expected clique size 
  is much smaller. 
  For more instances, see their generator in graph/contributed/brockington.

- PHat :: (From Patrick Soriano and Michel Gendreau patrick@crt.umontreal.ca) 
  Random problems generated with the p hat generator which is a 
  generalization of the classical uniform random graph generator. 
  Uses 3 parameters: n, the number of nodes, and a and b, two density 
  parameters verifying $0 \le a \le b \le 1$. Generates problem instances 
  having wider node degree spread and larger clique sizes. 
  Reference: "Solving the Maximum Clique Problem Using a Tabu Search Approach", 
  Annals of Operations Research 41, 385-403 (1993).

- Stein :: (From Carlo Mannino mannino@iasi.rm.cnr.it) 
  Clique formulation of the set covering formulation of the Steiner 
  Triple Problem. Created using Mannino's code to convert set covering 
  problems to clique problems.
  Notes: ~MANN~ graphs belongs to this class.

* Other Instances

- BHOSLIB :: Benchmarks with Hidden Optimum Solutions for Graph Problems (Maximum Clique, Maximum Independent Set, Minimum Vertex Cover and Vertex Coloring): [[http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm][http://www.nlsde.buaa.edu.cn/~kexu/benchmarks/graph-benchmarks.htm]]


-----

[[./index.html][Back to benchmark instances page]]


[fn:1] Optimal clique size obtained from various resources including  [[http://www.busygin.dp.ua/dimacs_clique.html][http://www.busygin.dp.ua/dimacs_clique.html]] and [[http://mat.gsia.cmu.edu/contents.clique.ps][http://mat.gsia.cmu.edu/contents.clique.ps]]

